In [1]:
import pandas as pd

In [62]:
from google.colab import files
uploaded = files.upload()

Saving adult.csv to adult (1).csv

In [9]:
# Dataset is now stored in a Pandas Dataframe
import io
df2 = pd.read_csv(io.BytesIO(uploaded['adult.csv']))

In [10]:
df2.head(20)

    age         workclass  fnlwgt  ... hours-per-week  native-country income
0    25           Private  226802  ...             40   United-States  <=50K
1    38           Private   89814  ...             50   United-States  <=50K
2    28         Local-gov  336951  ...             40   United-States   >50K
3    44           Private  160323  ...             40   United-States   >50K
4    18                 ?  103497  ...             30   United-States  <=50K
5    34           Private  198693  ...             30   United-States  <=50K
6    29                 ?  227026  ...             40   United-States  <=50K
7    63  Self-emp-not-inc  104626  ...             32   United-States   >50K
8    24           Private  369667  ...             40   United-States  <=50K
9    55           Private  104996  ...             10   United-States  <=50K
10   65           Private  184454  ...             40   United-States   >50K
11   36       Federal-gov  212465  ...             40   United-States  <=50K
12   26           Private   82091  ...             39   United-States  <=50K
13   58                 ?  299831  ...             35   United-States  <=50K
14   48           Private  279724  ...             48   United-States   >50K
15   43           Private  346189  ...             50   United-States   >50K
16   20         State-gov  444554  ...             25   United-States  <=50K
17   43           Private  128354  ...             30   United-States  <=50K
18   37           Private   60548  ...             20   United-States  <=50K
19   40           Private   85019  ...             45               ?   >50K

[20 rows x 15 columns]

In [12]:
df2.tail(5)

       age     workclass  fnlwgt  ... hours-per-week  native-country income
48837   27       Private  257302  ...             38   United-States  <=50K
48838   40       Private  154374  ...             40   United-States   >50K
48839   58       Private  151910  ...             40   United-States  <=50K
48840   22       Private  201490  ...             20   United-States  <=50K
48841   52  Self-emp-inc  287927  ...             40   United-States   >50K

[5 rows x 15 columns]

In [14]:
df2.shape

(48842, 15)

In [15]:
df2.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
educational-num     int64
marital-status     object
occupation         object
relationship       object
race               object
gender             object
capital-gain        int64
capital-loss        int64
hours-per-week      int64
native-country     object
income             object
dtype: object

In [17]:
df2.describe()

                age        fnlwgt  ...  capital-loss  hours-per-week
count  48842.000000  4.884200e+04  ...  48842.000000    48842.000000
mean      38.643585  1.896641e+05  ...     87.502314       40.422382
std       13.710510  1.056040e+05  ...    403.004552       12.391444
min       17.000000  1.228500e+04  ...      0.000000        1.000000
25%       28.000000  1.175505e+05  ...      0.000000       40.000000
50%       37.000000  1.781445e+05  ...      0.000000       40.000000
75%       48.000000  2.376420e+05  ...      0.000000       45.000000
max       90.000000  1.490400e+06  ...   4356.000000       99.000000

[8 rows x 6 columns]

In [19]:
df2.describe(include='O')

       workclass education      marital-status  ... gender native-country income
count      48842     48842               48842  ...  48842          48842  48842
unique         9        16                   7  ...      2             42      2
top      Private   HS-grad  Married-civ-spouse  ...   Male  United-States  <=50K
freq       33906     15784               22379  ...  32650          43832  37155

[4 rows x 9 columns]

In [20]:
df2.isna().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [21]:
# average hours per week
df2['hours-per-week'].mean()

40.422382375824085

In [22]:
# average hours per week for male and female
df2.groupby('gender')['hours-per-week'].mean()

gender
Female    36.400692
Male      42.416845
Name: hours-per-week, dtype: float64

In [25]:
#average hours per week for both gender for each working class

In [24]:
df2['workclass'].unique()

array(['Private', 'Local-gov', '?', 'Self-emp-not-inc', 'Federal-gov',
       'State-gov', 'Self-emp-inc', 'Without-pay', 'Never-worked'],
      dtype=object)

In [27]:
df2['gender'].unique()

array(['Male', 'Female'], dtype=object)

In [29]:
df2['workclass'].nunique() * df2['gender'].nunique() #I have to do 18 filters

18

In [31]:
df2.groupby(['workclass','gender'])['hours-per-week'].mean()

workclass         gender
?                 Female    29.914961
                  Male      33.388489
Federal-gov       Female    39.882743
                  Male      42.265306
Local-gov         Female    39.014308
                  Male      42.075080
Never-worked      Female    23.333333
                  Male      31.285714
Private           Female    36.510647
                  Male      42.229524
Self-emp-inc      Female    42.398104
                  Male      49.448113
Self-emp-not-inc  Female    37.227345
                  Male      45.789669
State-gov         Female    36.901704
                  Male      40.462233
Without-pay       Female    32.285714
                  Male      34.785714
Name: hours-per-week, dtype: float64

In [34]:
df2['workclass'].nunique() * df2['gender'].nunique() * df2['race'].nunique()

90

In [37]:
df2.groupby(['workclass','race','gender'])['hours-per-week'].mean()

workclass         race                gender
?                 Amer-Indian-Eskimo  Female    31.789474
                                      Male      38.875000
                  Asian-Pac-Islander  Female    28.617021
                                      Male      30.877551
                  Black               Female    33.629834
                                      Male      32.834483
                  Other               Female    31.450000
                                      Male      34.727273
                  White               Female    29.239282
                                      Male      33.465596
Federal-gov       Amer-Indian-Eskimo  Female    37.684211
                                      Male      40.928571
                  Asian-Pac-Islander  Female    41.294118
                                      Male      41.851064
                  Black               Female    40.057851
                                      Male      41.373134
                  Other               Female    39.000000
                                      Male      46.666667
                  White               Female    39.886207
                                      Male      42.433890
Local-gov         Amer-Indian-Eskimo  Female    37.516129
                                      Male      41.000000
                  Asian-Pac-Islander  Female    38.050000
                                      Male      40.205128
                  Black               Female    38.557522
                                      Male      40.279621
                  Other               Female    39.000000
                                      Male      41.090909
                  White               Female    39.187500
                                      Male      42.390398
Never-worked      Black               Female    30.000000
                                      Male      40.000000
                  White               Female    10.000000
                                      Male      29.833333
Private           Amer-Indian-Eskimo  Female    37.530000
                                      Male      42.168539
                  Asian-Pac-Islander  Female    37.573370
                                      Male      40.939259
                  Black               Female    36.987445
                                      Male      40.141304
                  Other               Female    36.043103
                                      Male      40.622449
                  White               Female    36.383464
                                      Male      42.466993
Self-emp-inc      Amer-Indian-Eskimo  Female    40.000000
                                      Male      30.000000
                  Asian-Pac-Islander  Female    46.750000
                                      Male      49.520833
                  Black               Female    36.833333
                                      Male      53.218750
                  Other               Male      64.500000
                  White               Female    42.218085
                                      Male      49.308518
Self-emp-not-inc  Amer-Indian-Eskimo  Female    35.833333
                                      Male      44.464286
                  Asian-Pac-Islander  Female    43.277778
                                      Male      48.719512
                  Black               Female    38.078947
                                      Male      42.408163
                  Other               Female    40.000000
                                      Male      43.533333
                  White               Female    36.987633
                                      Male      45.843522
State-gov         Amer-Indian-Eskimo  Female    41.555556
                                      Male      49.500000
                  Asian-Pac-Islander  Female    35.225806
                                      Male      37.131148
                  Black               Female    38.028369
                                      Male      39.949495
                  Other               Female    42.250000
                                      Male      37.000000
                  White               Female    36.567944
                                      Male      40.605010
Without-pay       Asian-Pac-Islander  Male      12.000000
                  Black               Male      40.000000
                  White               Female    32.285714
                                      Male      36.250000
Name: hours-per-week, dtype: float64

In [39]:
df2.groupby(['workclass','race','gender'])['hours-per-week'].mean()

workclass         race                gender
?                 Amer-Indian-Eskimo  Female    31.789474
                                      Male      38.875000
                  Asian-Pac-Islander  Female    28.617021
                                      Male      30.877551
                  Black               Female    33.629834
                                      Male      32.834483
                  Other               Female    31.450000
                                      Male      34.727273
                  White               Female    29.239282
                                      Male      33.465596
Federal-gov       Amer-Indian-Eskimo  Female    37.684211
                                      Male      40.928571
                  Asian-Pac-Islander  Female    41.294118
                                      Male      41.851064
                  Black               Female    40.057851
                                      Male      41.373134
                  Other               Female    39.000000
                                      Male      46.666667
                  White               Female    39.886207
                                      Male      42.433890
Local-gov         Amer-Indian-Eskimo  Female    37.516129
                                      Male      41.000000
                  Asian-Pac-Islander  Female    38.050000
                                      Male      40.205128
                  Black               Female    38.557522
                                      Male      40.279621
                  Other               Female    39.000000
                                      Male      41.090909
                  White               Female    39.187500
                                      Male      42.390398
Never-worked      Black               Female    30.000000
                                      Male      40.000000
                  White               Female    10.000000
                                      Male      29.833333
Private           Amer-Indian-Eskimo  Female    37.530000
                                      Male      42.168539
                  Asian-Pac-Islander  Female    37.573370
                                      Male      40.939259
                  Black               Female    36.987445
                                      Male      40.141304
                  Other               Female    36.043103
                                      Male      40.622449
                  White               Female    36.383464
                                      Male      42.466993
Self-emp-inc      Amer-Indian-Eskimo  Female    40.000000
                                      Male      30.000000
                  Asian-Pac-Islander  Female    46.750000
                                      Male      49.520833
                  Black               Female    36.833333
                                      Male      53.218750
                  Other               Male      64.500000
                  White               Female    42.218085
                                      Male      49.308518
Self-emp-not-inc  Amer-Indian-Eskimo  Female    35.833333
                                      Male      44.464286
                  Asian-Pac-Islander  Female    43.277778
                                      Male      48.719512
                  Black               Female    38.078947
                                      Male      42.408163
                  Other               Female    40.000000
                                      Male      43.533333
                  White               Female    36.987633
                                      Male      45.843522
State-gov         Amer-Indian-Eskimo  Female    41.555556
                                      Male      49.500000
                  Asian-Pac-Islander  Female    35.225806
                                      Male      37.131148
                  Black               Female    38.028369
                                      Male      39.949495
                  Other               Female    42.250000
                                      Male      37.000000
                  White               Female    36.567944
                                      Male      40.605010
Without-pay       Asian-Pac-Islander  Male      12.000000
                  Black               Male      40.000000
                  White               Female    32.285714
                                      Male      36.250000
Name: hours-per-week, dtype: float64

In [45]:
output_df =df2.groupby(['race','gender'])['age','hours-per-week'].mean()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [47]:
output_df

                                 age  hours-per-week
race               gender
Amer-Indian-Eskimo Female  36.237838       37.108108
                   Male    36.989474       42.326316
Asian-Pac-Islander Female  35.657640       37.241779
                   Male    38.994012       41.248503
Black              Female  37.905979       37.113951
                   Male    37.922592       40.038704
Other              Female  31.212903       35.987097
                   Male    35.167331       41.187251
White              Female  36.882935       36.235818
                   Male    39.704507       42.665947

Write a DataFrame into a file

In [51]:
output_df.to_csv("C://Users/Amil/Downloads/ouput.csv'") #saving as csv file

ImportError: ignored

In [ ]:
output_df.to_excel("output/GroupedOutput.xlsx") #saving as excel file

Value Counts                              
value_counts() function used to calculate the distribution

In [52]:
df2['gender'].value_counts()

Male      32650
Female    16192
Name: gender, dtype: int64

In [54]:
df2['workclass'].value_counts()

Private             33906
Self-emp-not-inc     3862
Local-gov            3136
?                    2799
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: workclass, dtype: int64

In [55]:
df2['race'].value_counts()

White                 41762
Black                  4685
Asian-Pac-Islander     1519
Amer-Indian-Eskimo      470
Other                   406
Name: race, dtype: int64

In [56]:
df2['workclass'].unique()

array(['Private', 'Local-gov', '?', 'Self-emp-not-inc', 'Federal-gov',
       'State-gov', 'Self-emp-inc', 'Without-pay', 'Never-worked'],
      dtype=object)

In [58]:
df2['workclass'].nunique()

9

Combaining 2 data frames

In [91]:
df1 = pd.DataFrame([[1,25,'F'],[2,26,'M'],[3,24,'F'],[4,27,'F'],[7,23,'F'],[8,20,'F'],[9,29,'M'],[10,21,'M']],columns=['ID','Age','Gender'])

In [92]:
df1

   ID  Age Gender
0   1   25      F
1   2   26      M
2   3   24      F
3   4   27      F
4   7   23      F
5   8   20      F
6   9   29      M
7  10   21      M

In [93]:
df2 = pd.DataFrame([[1,'A'],[2,'B'],[3,'C'],[4,'D'],[5,'E'],[6,'F'],[7,'G'],[8,'H']],columns=['ID','Name'])

In [94]:
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D
4   5    E
5   6    F
6   7    G
7   8    H

Merge is the function used for SQL joins in Pandas

In [95]:
inner_join=pd.merge(df1,df2,how="inner",on="ID")  #df1 - Left Table df2 - Right Table
inner_join

   ID  Age Gender Name
0   1   25      F    A
1   2   26      M    B
2   3   24      F    C
3   4   27      F    D
4   7   23      F    G
5   8   20      F    H

In [96]:
left_join=pd.merge(df1,df2,how="left",on="ID")
left_join

   ID  Age Gender Name
0   1   25      F    A
1   2   26      M    B
2   3   24      F    C
3   4   27      F    D
4   7   23      F    G
5   8   20      F    H
6   9   29      M  NaN
7  10   21      M  NaN

In [97]:
right_join=pd.merge(df1,df2,how="right",on="ID")
right_join

   ID   Age Gender Name
0   1  25.0      F    A
1   2  26.0      M    B
2   3  24.0      F    C
3   4  27.0      F    D
4   5   NaN    NaN    E
5   6   NaN    NaN    F
6   7  23.0      F    G
7   8  20.0      F    H

In [98]:
outer_join=pd.merge(df1,df2,how="outer",on="ID")
outer_join

   ID   Age Gender Name
0   1  25.0      F    A
1   2  26.0      M    B
2   3  24.0      F    C
3   4  27.0      F    D
4   7  23.0      F    G
5   8  20.0      F    H
6   9  29.0      M  NaN
7  10  21.0      M  NaN
8   5   NaN    NaN    E
9   6   NaN    NaN    F

## Concat function used to merge dataframes by index in row level and column level

### concat is accepting list of dataframes as paramet

In [99]:
df1 = df1.drop('ID',axis=1)
df1

   Age Gender
0   25      F
1   26      M
2   24      F
3   27      F
4   23      F
5   20      F
6   29      M
7   21      M

In [100]:
df2 = df2.drop('ID',axis=1)
df2

  Name
0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H

In [101]:
#column level (axis =1)
pd.concat([df1,df2],axis=1)

   Age Gender Name
0   25      F    A
1   26      M    B
2   24      F    C
3   27      F    D
4   23      F    E
5   20      F    F
6   29      M    G
7   21      M    H

In [102]:
df1 = pd.DataFrame([[25,'F'],[26,'M'],[24,'F'],[27,'F'],[23,'F'],[20,'F'],[29,'M'],[21,'M']],columns=['Age','Gender'])

In [103]:
df1

   Age Gender
0   25      F
1   26      M
2   24      F
3   27      F
4   23      F
5   20      F
6   29      M
7   21      M

In [104]:
df2 = pd.DataFrame([[50,'F'],[50,'M'],[50,'F'],[50,'F']],columns=['Age','Gender'])
df2

   Age Gender
0   50      F
1   50      M
2   50      F
3   50      F

In [105]:
#row level
pd.concat([df1,df2],axis=0)

   Age Gender
0   25      F
1   26      M
2   24      F
3   27      F
4   23      F
5   20      F
6   29      M
7   21      M
0   50      F
1   50      M
2   50      F
3   50      F

In [106]:
df3 = pd.DataFrame([[1,'A'],[2,'B'],[3,'C'],[4,'D'],[5,'E'],[6,'F'],[7,'G'],[8,'H'],[9,'I']],columns=['Name_ID','Name'])

In [107]:
df3

   Name_ID Name
0        1    A
1        2    B
2        3    C
3        4    D
4        5    E
5        6    F
6        7    G
7        8    H
8        9    I

In [108]:
df4 = pd.DataFrame([[1,'M'],[2,'M'],[3,'M'],[4,'F'],[5,'F'],[10,'F'],[11,'F'],[8,'M'],[9,'M']],columns=['Gender_ID','Gender'])
df4

   Gender_ID Gender
0          1      M
1          2      M
2          3      M
3          4      F
4          5      F
5         10      F
6         11      F
7          8      M
8          9      M

Using Merge function with 2 key columns

In [109]:
pd.merge(df3,df4,how="inner",left_on = 'Name_ID',right_on='Gender_ID')

   Name_ID Name  Gender_ID Gender
0        1    A          1      M
1        2    B          2      M
2        3    C          3      M
3        4    D          4      F
4        5    E          5      F
5        8    H          8      M
6        9    I          9      M

In [110]:
pd.merge(df3,df4,how='right',left_on = 'Name_ID',right_on='Gender_ID')

   Name_ID Name  Gender_ID Gender
0      1.0    A          1      M
1      2.0    B          2      M
2      3.0    C          3      M
3      4.0    D          4      F
4      5.0    E          5      F
5      NaN  NaN         10      F
6      NaN  NaN         11      F
7      8.0    H          8      M
8      9.0    I          9      M

In [111]:
pd.merge(df3,df4,how="outer",left_on = 'Name_ID',right_on='Gender_ID')

    Name_ID Name  Gender_ID Gender
0       1.0    A        1.0      M
1       2.0    B        2.0      M
2       3.0    C        3.0      M
3       4.0    D        4.0      F
4       5.0    E        5.0      F
5       6.0    F        NaN    NaN
6       7.0    G        NaN    NaN
7       8.0    H        8.0      M
8       9.0    I        9.0      M
9       NaN  NaN       10.0      F
10      NaN  NaN       11.0      F

# 1)what is the total gross income?

 2) which is the most commonly used payment type

3)what is the average unit price of the products

4)what is the total number of sales

5)what is the average gross income

6)what is the standard deviation of product unit price

7)what are the different types of Product line

8)How many customer classes are there

In [63]:
from google.colab import files
uploaded = files.upload()

Saving supermarket_sales.csv to supermarket_sales.csv

In [67]:
# Dataset is now stored in a Pandas Dataframe
import io
df = pd.read_csv(io.BytesIO(uploaded['supermarket_sales.csv']))

In [68]:
df.head()

    Invoice ID Branch       City  ... gross margin percentage gross income Rating
0  750-67-8428      A     Yangon  ...                4.761905      26.1415    9.1
1  226-31-3081      C  Naypyitaw  ...                4.761905       3.8200    9.6
2  631-41-3108      A     Yangon  ...                4.761905      16.2155    7.4
3  123-19-1176      A     Yangon  ...                4.761905      23.2880    8.4
4  373-73-7910      A     Yangon  ...                4.761905      30.2085    5.3

[5 rows x 17 columns]

In [69]:
df.tail()

      Invoice ID Branch  ... gross income Rating
995  233-67-5758      C  ...       2.0175    6.2
996  303-96-2227      B  ...      48.6900    4.4
997  727-02-1313      A  ...       1.5920    7.7
998  347-56-2442      A  ...       3.2910    4.1
999  849-09-3807      A  ...      30.9190    6.6

[5 rows x 17 columns]

In [70]:
df.describe()

        Unit price     Quantity  ...  gross income      Rating
count  1000.000000  1000.000000  ...   1000.000000  1000.00000
mean     55.672130     5.510000  ...     15.379369     6.97270
std      26.494628     2.923431  ...     11.708825     1.71858
min      10.080000     1.000000  ...      0.508500     4.00000
25%      32.875000     3.000000  ...      5.924875     5.50000
50%      55.230000     5.000000  ...     12.088000     7.00000
75%      77.935000     8.000000  ...     22.445250     8.50000
max      99.960000    10.000000  ...     49.650000    10.00000

[8 rows x 7 columns]

In [71]:
df.shape

(1000, 17)

In [73]:
df.isna().sum()

Invoice ID                 0
Branch                     0
City                       0
Customer type              0
Gender                     0
Product line               0
Unit price                 0
Quantity                   0
Tax 5%                     0
Total                      0
Date                       0
Time                       0
Payment                    0
cogs                       0
gross margin percentage    0
gross income               0
Rating                     0
dtype: int64

In [74]:
df.dtypes

Invoice ID                  object
Branch                      object
City                        object
Customer type               object
Gender                      object
Product line                object
Unit price                 float64
Quantity                     int64
Tax 5%                     float64
Total                       object
Date                        object
Time                        object
Payment                     object
cogs                       float64
gross margin percentage    float64
gross income               float64
Rating                     float64
dtype: object

In [65]:
# what is the total gross income?
total_income=df['gross income'].sum()
print("total gross income=",total_income)

total gross income= 15379.368999999999

In [76]:
# which is the most commonly used payment type
payment_type = df['Payment'].mode()[0]
print('Most commonly used payment type:',payment_type)

Most commonly used payment type: Ewallet

In [78]:
# what is the average unit price of the products
average_up = df['Unit price'].mean()
print('Average Unit Price of Products : ',average_up)

Average Unit Price of Products :  55.67212999999998

In [80]:
# what is the total number of sales(unique number of invoice id)

sales = df.shape[0]
print("Total number of sales: ",sales)

Total number of sales:  1000

In [82]:
#what is average gross income per sales
average_income = df['gross income'].mean()
print('Average Gross Income:',average_income)

Average Gross Income: 15.379369000000002

In [84]:
#what is the standard deviation of product unit price
std = df['Unit price'].std()
print('Standard Deviation of Unit Price:',std)

Standard Deviation of Unit Price: 26.494628347919768

In [86]:
#what is the total number of sales(unique number of invoice id)?
sales = df.describe(include='O').loc['unique','Invoice ID']
print("Total number of sales: ",sales)

Total number of sales:  1000

In [88]:
#unique and nunique


# What are the different types of Product Line

df['Product line'].unique()

array(['Health and beauty', 'Electronic accessories',
       'Home and lifestyle', 'Sports and travel', 'Food and beverages',
       'Fashion accessories'], dtype=object)

In [90]:
#How many customer classes are there

df['Customer type'].nunique()

2